VirtualGarageSale/app/controllers/products_controller.rb

  def index
    @products = Product.all.order("created_at desc")
---
SELECT "products".* FROM "products" ORDER BY created_at desc

  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "price", "description", "condition", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "description" = ?, "updated_at" = ?, "image" = ? WHERE "products"."id" = ?  [["title", "3D Crow"], ["description", "A crow created in Blender by yours truly!"], ["updated_at", "2018-10-18 01:01:33.346152"], ["image", "\"Crow_Preview.png\""], ["id", 2]]